# Используем официальный образ Go для сборки приложения
FROM golang:1.17-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем все файлы проекта в контейнер
COPY . .

# Сборка приложения
RUN go build -o main .

# Используем минимальный образ для запуска приложения
FROM alpine:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /root/

# Копируем скомпилированное приложение из предыдущего этапа
COPY --from=builder /app/main .

# Открываем порт 8081
EXPOSE 8081

# Команда для запуска приложения
CMD ["./main"]
